#### Import Pandas module as pd

In [67]:
import pandas as pd

#### Reads the .csv file 'gym.csv' using ';' as separator

In [68]:
df = pd.read_csv('gym.csv', sep = ';', parse_dates=['date'])

#### Shows the first n rows from the DataFrame (5 rows if the argument is ommited)

In [69]:
df.head(3)

,id,name,date,height,weight,age,hours,status,children,sex
0,1373913,Marisa Martins,02/05/2013,155,48,45,3,married,2,F
1,1109818,Rita Fonseca,28/08/2018,166,54,45,3,married,3,F
2,1158813,Joana Freitas,21/10/2013,150,42,52,3,widow,1,F

#### Shows the last n rows from the DataFrame (5 rows if the argument is ommited)

In [70]:
df.tail(3)

,id,name,date,height,weight,age,hours,status,children,sex
57,1150114,Antonio Goncalves,22/11/2014,158,49,34,3,single,0,M
58,1658815,Manuel Freitas,11/06/2015,170,51,57,1,widow,2,M
59,1769504,Joao Tavares,06/08/2004,177,85,32,3,married,2,M

#### Get the number of lines and columns of the DataFrame

In [71]:
df.shape

(60, 10)

#### General info about the DataFrame

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        60 non-null     int64
 1   name      60 non-null     object
 2   date      60 non-null     object
 3   height    60 non-null     int64
 4   weight    60 non-null     int64
 5   age       60 non-null     int64
 6   hours     60 non-null     int64
 7   status    60 non-null     object
 8   children  60 non-null     int64
 9   sex       60 non-null     object
dtypes: int64(6), object(4)
memory usage: 4.8+ KB

#### Get the type of data in each DataFrame column. Type object is Python string

In [73]:
df.dtypes

id           int64
name        object
date        object
height       int64
weight       int64
age          int64
hours        int64
status      object
children     int64
sex         object
dtype: object

#### Access the row with label 0. Returns a series

In [74]:
df.loc[0]

id                 1373913
name        Marisa Martins
date            02/05/2013
height                 155
weight                  48
age                     45
hours                    3
status             married
children                 2
sex                      F
Name: 0, dtype: object

In [75]:
type(df.loc[0])

pandas.core.series.Series

#### Access all the rows from column 'age'

In [76]:
s = df.loc[:,'age']

In [77]:
s.head()

0    45
1    45
2    52
3    59
4    43
Name: age, dtype: int64

In [78]:
type(s)

pandas.core.series.Series

#### Access value in row with label 0 in column 'age'

In [79]:
df.loc[0,'age']

45

#### Access the rows with labels 0, 2 and 4

In [80]:
df.loc[[0,2,4]]

,id,name,date,height,weight,age,hours,status,children,sex
0,1373913,Marisa Martins,02/05/2013,155,48,45,3,married,2,F
2,1158813,Joana Freitas,21/10/2013,150,42,52,3,widow,1,F
4,1974509,Francisco Fonseca,22/08/2009,162,52,43,2,married,1,M

#### Access values in rows with labels 0 and 2 and columns 'name' and 'age'

In [81]:
df.loc[[0,2],['name', 'age']]

             name  age
0  Marisa Martins   45
2   Joana Freitas   52

#### Access the values between rows with labels 0 and 2 and between columns 'name' and 'age'

In [82]:
df.loc[0:2,'name':'age']

             name        date  height  weight  age
0  Marisa Martins  02/05/2013     155      48   45
1    Rita Fonseca  28/08/2018     166      54   45
2   Joana Freitas  21/10/2013     150      42   52

#### Access the value in row 1 and column 1

In [83]:
df.iloc[1,1]

'Rita Fonseca'

#### Access to all the values in row 1

In [84]:
df.iloc[1,:]

id               1109818
name        Rita Fonseca
date          28/08/2018
height               166
weight                54
age                   45
hours                  3
status           married
children               3
sex                    F
Name: 1, dtype: object

#### Access rows between 0 and 2 and columns between 2 and 4

In [85]:
df.iloc[0:2,2:4]

         date  height
0  02/05/2013     155
1  28/08/2018     166

#### Row index, by default an integer row number

In [86]:
df.index

RangeIndex(start=0, stop=60, step=1)

#### Column index - column names

In [87]:
df.columns

Index(['id', 'name', 'date', 'height', 'weight', 'age', 'hours', 'status',
       'children', 'sex'],
      dtype='object')

#### Set column 'name' as the new index

In [88]:
df.set_index('name', inplace=True)

#### The values in a row can be accessed using the index of the row

In [89]:
df.loc['Jose Carvalho']

id             1871004
date        17/09/2004
height             153
weight              67
age                 26
hours                7
status         married
children             1
sex                  M
Name: Jose Carvalho, dtype: object

#### The DataFrame index can be sorted

In [90]:
df.sort_index(ascending=False)

,id,date,height,weight,age,hours,status,children,sex
name,,,,,,,,,
Susana Marinho,1521112,18/08/2012,174,60,35,5,single,0,F
Susana Madeira,1436908,09/05/2008,160,49,56,2,divorced,2,F
Susana Goncalves,1170413,07/03/2013,157,65,40,2,married,5,F
Sonia Pinho,1337319,11/02/2019,177,63,34,5,single,0,F
Sonia Pereira,1374905,17/10/2005,178,94,37,3,married,3,F
Sonia Marinho,1564109,06/11/2009,156,46,41,2,married,3,F
Sonia Goncalves,1471416,07/05/2016,170,52,43,3,married,2,F
Sonia Fonseca,1320306,12/09/2006,152,46,37,4,married,1,F
Rita Madeira,1204821,11/06/2021,151,45,44,2,married,2,F
Rita Fonseca,1109818,28/08/2018,166,54,45,3,married,3,F
Rita Cruz,1930916,10/11/2016,168,52,56,3,married,2,F
Pedro Madeira,1610119,19/05/2019,163,53,28,5,married,4,M
Pedro Goncalves,1776804,09/03/2004,156,46,32,5,single,0,M
Pedro Fonseca,1065208,09/02/2008,153,80,49,1,married,2,M
Pedro Cruz,1221721,11/08/2021,161,50,43,3,single,1,M
Marisa Martins,1373913,02/05/2013,155,48,45,3,married,2,F
Marisa Cruz,1223600,16/10/2000,171,61,42,4,married,2,F
Manuel Pinho,1315817,23/12/2017,179,58,29,5,single,0,M
Manuel Martins,1767703,25/01/2003,179,85,24,6,single,0,M
Manuel Marinho,1417018,20/06/2018,173,57,40,3,divorced,2,M
Manuel Madeira,1098118,30/06/2018,165,55,34,4,married,1,M
Manuel Freitas,1658815,11/06/2015,170,51,57,1,widow,2,M
Manuel Fonseca,1373707,24/09/2007,175,102,40,3,married,1,M
Manuel Cruz,1710710,27/11/2010,178,55,44,3,married,2,M
Manuel Carvalho,1235914,27/08/2014,158,45,38,3,married,2,M
Jose Fonseca,1359417,28/10/2017,155,68,41,3,married,0,M
Jose Cruz,1068508,12/02/2008,177,90,27,6,married,0,M
Jose Carvalho,1871004,17/09/2004,153,67,26,7,married,1,M
Joao Tavares,1769504,06/08/2004,177,85,32,3,married,2,M
Joao Pinho,1152520,29/11/2020,154,66,55,1,single,0,M
Joao Madeira,1286112,19/08/2012,152,78,29,6,single,1,M
Joao Freitas,1642316,23/10/2016,165,50,54,3,married,2,M
Joana Pereira,1147413,24/03/2013,162,49,34,5,married,2,F
Joana Marinho,1466415,26/11/2015,164,51,57,1,married,3,F
Joana Goncalves,1566515,16/11/2015,161,49,59,2,married,2,F
Joana Freitas,1158813,21/10/2013,150,42,52,3,widow,1,F
Joana Carvalho,1758412,09/08/2012,174,59,37,3,married,2,F
Francisco Pinho,1294215,25/08/2015,154,58,23,6,single,3,M
Francisco Pereira,1953503,03/04/2003,170,79,49,2,married,1,M
Francisco Martins,1410714,25/11/2014,153,58,24,7,single,0,M
Francisco Madeira,1692512,24/09/2012,154,49,23,8,single,0,M
Francisco Freitas,1560118,15/07/2018,152,53,41,3,married,2,M
Francisco Fonseca,1974509,22/08/2009,162,52,43,2,married,1,M
Francisco Carvalho,1653302,05/09/2002,150,66,23,7,single,0,M
Florbela Pereira,1705816,12/08/2016,171,58,32,6,married,0,F
Florbela Marinho,1305314,24/04/2014,154,62,36,4,married,1,F
Florbela Goncalves,1998809,07/01/2009,169,50,39,4,single,1,F
Florbela Freitas,1071208,26/09/2008,166,53,28,5,single,0,F
Florbela Cruz,1971506,08/10/2006,166,54,47,3,married,3,F
Catarina Pereira,1177213,13/10/2013,175,88,54,1,married,1,F
Catarina Marinho,1331601,15/01/2001,178,63,43,3,married,2,F
Catarina Madeira,1200611,24/10/2011,154,63,46,2,single,2,F
Catarina Goncalves,1055806,21/09/2006,168,53,59,2,widow,3,F
Catarina Freitas,1105321,10/07/2021,166,70,40,4,single,0,F
Catarina Cruz,1967921,13/10/2021,176,61,30,5,single,1,F
Catarina Carvalho,1058304,25/09/2004,150,45,59,2,married,4,F
Antonio Pereira,1811504,16/02/2004,154,61,51,2,married,1,M
Antonio Goncalves,1150114,22/11/2014,158,49,34,3,single,0,M
Antonio Fonseca,1867513,07/06/2013,164,53,41,3,married,3,M
Antonio Carvalho,1856501,02/07/2001,159,73,24,6,single,0,M

#### The DataFrame can be sorted by the values in another column

In [91]:
df.sort_values('age').head(5)

,id,date,height,weight,age,hours,status,children,sex
name,,,,,,,,,
Francisco Pinho,1294215,25/08/2015,154,58,23,6,single,3,M
Francisco Carvalho,1653302,05/09/2002,150,66,23,7,single,0,M
Francisco Madeira,1692512,24/09/2012,154,49,23,8,single,0,M
Antonio Carvalho,1856501,02/07/2001,159,73,24,6,single,0,M
Manuel Martins,1767703,25/01/2003,179,85,24,6,single,0,M

#### Reset the index to the default

In [92]:
df.reset_index(inplace=True)

#### Statistical functions can be used in DataFrame column series

In [93]:
df['age'].mean()

40.083333333333336

In [94]:
df['height'].max()

179

In [95]:
df['weight'].min()

42

In [96]:
df.describe()

                 id      height     weight        age      hours   children
count  6.000000e+01   60.000000   60.00000  60.000000  60.000000  60.000000
mean   1.461868e+06  163.533333   59.95000  40.083333   3.600000   1.483333
std    2.932733e+05    9.307308   13.55144  10.469150   1.719282   1.214205
min    1.055806e+06  150.000000   42.00000  23.000000   1.000000   0.000000
25%    1.203768e+06  154.000000   50.00000  32.000000   2.000000   0.000000
50%    1.392810e+06  163.500000   56.00000  40.000000   3.000000   1.500000
75%    1.707040e+06  171.000000   65.25000  46.250000   5.000000   2.000000
max    1.998809e+06  179.000000  102.00000  59.000000   8.000000   5.000000

#### The DataFrame elements can be accessed in Python code

In [97]:
def avg(col_name):
    s = 0
    n = len(df[col_name])
    for i in df[col_name]:
        s = s + i
    avg = s / n
    return avg

In [98]:
avg('age')

40.083333333333336

**Create a new column with the number of years at the gym and insert it at position 3**

In [99]:
df.insert(3, 'years', 2021 - df['date'].dt.year)

AttributeError: Can only use .dt accessor with datetimelike values

**Create new columns at last position**

In [ ]:
df['days'] = df['years'] * 365

In [ ]:
df['old_client'] = df['years'] > 7

In [ ]:
df.head(3)

**Remove the columns years, days and old_client**

In [ ]:
df.drop('years', axis = 1, inplace = True)

In [ ]:
del df['days']

In [ ]:
old_client = df.pop('old_client')

In [ ]:
df.head(3)

**Set the column names**

In [ ]:
df.columns = ['Name', 'Id', 'Date', 'Height', 'Weight', 'Age', 'Hours', 'Status', 'Children', 'Sex']

In [ ]:
df.head(3)

**Change the column name using the str replace method**

In [ ]:
df.columns = df.columns.str.replace('Age', 'age')

In [ ]:
df.head(3)

**Change the column names using the rename method**

In [ ]:
df.rename(columns={'Name':'name', 'Id': 'id'}, inplace=True)

In [ ]:
df.head(3)

**Change the column names using list comprehension**

In [ ]:
df.columns = [x.lower() for x in df.columns]

In [ ]:
df.head(3)

#### Assign a new set of values to a row

In [ ]:
df.loc[0] = ['Antonio Gomes',1354891, '2018-05-20',100, 20, 30, 2, 'widow',1, 'M']
df.head(2)

**Change some of the values in a row**

In [ ]:
df.loc[0,['id', 'status']] = [1234567, 'single']
df.head(2)

**Append a row to a DataFrame**

In [ ]:
df = df.append({'name':'Xavier Furtado','id':1111111,'height':150},ignore_index=True)
df.tail(2)

**Delete a row**

In [ ]:
df.drop(60, inplace=True)
df.tail(2)

**Select the customers over 55 years old**

In [ ]:
df.loc[df['age'] > 55]

**Select the customers over 55 years old and weight over 50kg**

In [ ]:
df.loc[(df['age'] > 55) & (df['weight'] > 50)]

**Select the customers over 55 or under 24 years old. View name and age**

In [ ]:
df.loc[(df['age'] > 57) | (df['age'] < 24), ['name', 'age']]

**Select the customers with status: divorced or widow**

In [ ]:
df.loc[df['status'].isin(['divorced','widow'])]

**Select the customers with name Freitas**

In [ ]:
df.loc[df['name'].str.contains('Freitas',na=False)]

**Apply a function to all the elements of a Series**

In [ ]:
df['status'] = df['status'].apply(str.upper)
df.head(2)

**Get the unique elements from a series**

In [ ]:
df['status'].unique()

**Return the number of counts of unique values**

In [ ]:
df['status'].value_counts()

In [ ]:
df['status'] = df['status'].apply(str.lower)

**Groupby can be used to count values by group**

In [ ]:
df.groupby('sex')['status'].value_counts()

**Write a DataFrame to a .csv and Excel files**

In [ ]:
df.to_csv('gym_new.csv', sep = ';', index=False)

In [ ]:
df.to_excel('gym_new.xlsx', index=False)